{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_1-image", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 64, 64, 1], "dtype": "float32", "sparse": false, "name": "input_1-image"}, "inbound_nodes": []}, {"name": "conv2d_1-image", "class_name": "Conv2D", "config": {"name": "conv2d_1-image", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_1-image", 0, 0, {}]]]}, {"name": "dropout_1-image", "class_name": "Dropout", "config": {"name": "dropout_1-image", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv2d_1-image", 0, 0, {}]]]}, {"name": "input_1-dlib", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 68, 2], "dtype": "float32", "sparse": false, "name": "input_1-dlib"}, "inbound_nodes": []}, {"name": "input_2-dlib", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 68, 1], "dtype": "float32", "sparse": false, "name": "input_2-dlib"}, "inbound_nodes": []}, {"name": "input_3-dlib", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 68, 1], "dtype": "float32", "sparse": false, "name": "input_3-dlib"}, "inbound_nodes": []}, {"name": "conv2d_2-image", "class_name": "Conv2D", "config": {"name": "conv2d_2-image", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_1-image", 0, 0, {}]]]}, {"name": "conv2d_1-dlib", "class_name": "Conv2D", "config": {"name": "conv2d_1-dlib", "trainable": true, "filters": 32, "kernel_size": [1, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_1-dlib", 0, 0, {}]]]}, {"name": "conv2d_4-dlib", "class_name": "Conv2D", "config": {"name": "conv2d_4-dlib", "trainable": true, "filters": 32, "kernel_size": [1, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_2-dlib", 0, 0, {}]]]}, {"name": "conv2d_7-dlib", "class_name": "Conv2D", "config": {"name": "conv2d_7-dlib", "trainable": true, "filters": 32, "kernel_size": [1, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_3-dlib", 0, 0, {}]]]}, {"name": "dropout_2-image", "class_name": "Dropout", "config": {"name": "dropout_2-image", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv2d_2-image", 0, 0, {}]]]}, {"name": "conv2d_2-dlib", "class_name": "Conv2D", "config": {"name": "conv2d_2-dlib", "trainable": true, "filters": 32, "kernel_size": [1, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_1-dlib", 0, 0, {}]]]}, {"name": "conv2d_5-dlib", "class_name": "Conv2D", "config": {"name": "conv2d_5-dlib", "trainable": true, "filters": 32, "kernel_size": [1, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_4-dlib", 0, 0, {}]]]}, {"name": "conv2d_8-dlib", "class_name": "Conv2D", "config": {"name": "conv2d_8-dlib", "trainable": true, "filters": 32, "kernel_size": [1, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_7-dlib", 0, 0, {}]]]}, {"name": "max_pooling2d_1-image", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1-image", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["dropout_2-image", 0, 0, {}]]]}, {"name": "max_pooling2d_1-dlib", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1-dlib", "trainable": true, "pool_size": [1, 2], "padding": "valid", "strides": [1, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_2-dlib", 0, 0, {}]]]}, {"name": "max_pooling2d_3-dlib", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3-dlib", "trainable": true, "pool_size": [1, 2], "padding": "valid", "strides": [1, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_5-dlib", 0, 0, {}]]]}, {"name": "max_pooling2d_5-dlib", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_5-dlib", "trainable": true, "pool_size": [1, 2], "padding": "valid", "strides": [1, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_8-dlib", 0, 0, {}]]]}, {"name": "conv2d_3-image", "class_name": "Conv2D", "config": {"name": "conv2d_3-image", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_1-image", 0, 0, {}]]]}, {"name": "conv2d_3-dlib", "class_name": "Conv2D", "config": {"name": "conv2d_3-dlib", "trainable": true, "filters": 64, "kernel_size": [1, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_1-dlib", 0, 0, {}]]]}, {"name": "conv2d_6-dlib", "class_name": "Conv2D", "config": {"name": "conv2d_6-dlib", "trainable": true, "filters": 64, "kernel_size": [1, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_3-dlib", 0, 0, {}]]]}, {"name": "conv2d_9-dlib", "class_name": "Conv2D", "config": {"name": "conv2d_9-dlib", "trainable": true, "filters": 64, "kernel_size": [1, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_5-dlib", 0, 0, {}]]]}, {"name": "dropout_3-image", "class_name": "Dropout", "config": {"name": "dropout_3-image", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv2d_3-image", 0, 0, {}]]]}, {"name": "max_pooling2d_2-dlib", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2-dlib", "trainable": true, "pool_size": [1, 2], "padding": "valid", "strides": [1, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_3-dlib", 0, 0, {}]]]}, {"name": "max_pooling2d_4-dlib", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_4-dlib", "trainable": true, "pool_size": [1, 2], "padding": "valid", "strides": [1, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_6-dlib", 0, 0, {}]]]}, {"name": "max_pooling2d_6-dlib", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_6-dlib", "trainable": true, "pool_size": [1, 2], "padding": "valid", "strides": [1, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_9-dlib", 0, 0, {}]]]}, {"name": "max_pooling2d_2-image", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2-image", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["dropout_3-image", 0, 0, {}]]]}, {"name": "flatten_1-dlib", "class_name": "Flatten", "config": {"name": "flatten_1-dlib", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling2d_2-dlib", 0, 0, {}]]]}, {"name": "flatten_2-dlib", "class_name": "Flatten", "config": {"name": "flatten_2-dlib", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling2d_4-dlib", 0, 0, {}]]]}, {"name": "flatten_3-dlib", "class_name": "Flatten", "config": {"name": "flatten_3-dlib", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling2d_6-dlib", 0, 0, {}]]]}, {"name": "flatten_1-image", "class_name": "Flatten", "config": {"name": "flatten_1-image", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling2d_2-image", 0, 0, {}]]]}, {"name": "concatenate_1-dlib", "class_name": "Concatenate", "config": {"name": "concatenate_1-dlib", "trainable": true, "axis": -1}, "inbound_nodes": [[["flatten_1-dlib", 0, 0, {}], ["flatten_2-dlib", 0, 0, {}], ["flatten_3-dlib", 0, 0, {}]]]}, {"name": "concat_all", "class_name": "Concatenate", "config": {"name": "concat_all", "trainable": true, "axis": -1}, "inbound_nodes": [[["flatten_1-image", 0, 0, {}], ["concatenate_1-dlib", 0, 0, {}]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concat_all", 0, 0, {}]]]}, {"name": "dropout_1", "class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"name": "dense_2", "class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "units": 252, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"name": "dropout_2", "class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"name": "dense_3", "class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "units": 7, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}], "input_layers": [["input_1-image", 0, 0], ["input_1-dlib", 0, 0], ["input_2-dlib", 0, 0], ["input_3-dlib", 0, 0]], "output_layers": [["dense_3", 0, 0]]}, "keras_version": "2.1.6", "backend": "tensorflow"}