{"class_name": "Sequential", "keras_version": "1.2.2", "config": [{"class_name": "Merge", "config": {"layers": [{"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, 48, 48, 1], "sparse": false, "input_dtype": "float32", "name": "input_1"}, "name": "input_1"}, {"class_name": "Convolution2D", "inbound_nodes": [[["input_1", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_1", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "activation": "relu", "border_mode": "valid"}, "name": "convolution2d_1"}, {"class_name": "Convolution2D", "inbound_nodes": [[["convolution2d_1", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_2", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "activation": "relu", "border_mode": "valid"}, "name": "convolution2d_2"}, {"class_name": "Dropout", "inbound_nodes": [[["convolution2d_2", 0, 0]]], "config": {"p": 0.2, "trainable": true, "name": "dropout_1"}, "name": "dropout_1"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["dropout_1", 0, 0]]], "config": {"name": "maxpooling2d_1", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "name": "maxpooling2d_1"}, {"class_name": "Convolution2D", "inbound_nodes": [[["maxpooling2d_1", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_3", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "activation": "relu", "border_mode": "valid"}, "name": "convolution2d_3"}, {"class_name": "Dropout", "inbound_nodes": [[["convolution2d_3", 0, 0]]], "config": {"p": 0.2, "trainable": true, "name": "dropout_2"}, "name": "dropout_2"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["dropout_2", 0, 0]]], "config": {"name": "maxpooling2d_2", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "name": "maxpooling2d_2"}, {"class_name": "Flatten", "inbound_nodes": [[["maxpooling2d_2", 0, 0]]], "config": {"trainable": true, "name": "flatten_1"}, "name": "flatten_1"}], "input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["flatten_1", 0, 0]]}}, {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, 1, 68, 2], "sparse": false, "input_dtype": "float32", "name": "input_2"}, "name": "input_2"}, {"class_name": "Convolution2D", "inbound_nodes": [[["input_2", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_4", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "b_regularizer": null, "W_regularizer": null, "nb_row": 1, "activation": "relu", "border_mode": "valid"}, "name": "convolution2d_4"}, {"class_name": "Flatten", "inbound_nodes": [[["convolution2d_4", 0, 0]]], "config": {"trainable": true, "name": "flatten_2"}, "name": "flatten_2"}], "input_layers": [["input_2", 0, 0]], "name": "model_2", "output_layers": [["flatten_2", 0, 0]]}}, {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, 1, 68, 1], "sparse": false, "input_dtype": "float32", "name": "input_3"}, "name": "input_3"}, {"class_name": "Convolution2D", "inbound_nodes": [[["input_3", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_5", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "b_regularizer": null, "W_regularizer": null, "nb_row": 1, "activation": "relu", "border_mode": "valid"}, "name": "convolution2d_5"}, {"class_name": "Flatten", "inbound_nodes": [[["convolution2d_5", 0, 0]]], "config": {"trainable": true, "name": "flatten_3"}, "name": "flatten_3"}], "input_layers": [["input_3", 0, 0]], "name": "model_3", "output_layers": [["flatten_3", 0, 0]]}}, {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, 1, 68, 1], "sparse": false, "input_dtype": "float32", "name": "input_4"}, "name": "input_4"}, {"class_name": "Convolution2D", "inbound_nodes": [[["input_4", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_6", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "b_regularizer": null, "W_regularizer": null, "nb_row": 1, "activation": "relu", "border_mode": "valid"}, "name": "convolution2d_6"}, {"class_name": "Flatten", "inbound_nodes": [[["convolution2d_6", 0, 0]]], "config": {"trainable": true, "name": "flatten_4"}, "name": "flatten_4"}], "input_layers": [["input_4", 0, 0]], "name": "model_4", "output_layers": [["flatten_4", 0, 0]]}}], "name": "merge_1", "concat_axis": -1, "arguments": {}, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "output_shape_type": "raw", "output_mask": null, "output_shape": null, "mode": "concat"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 19136, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 128}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_3"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_2", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 128, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 252}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_4"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_3", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 252, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "output_dim": 7}}]}